//! -----------------------  Task-1  `Simple JS Program`  ------------------------

//* I have 10$ amount
// let amount = 20;

//* Cookies cost 7$ cookiesPrice
//* Candies cost 8$
// let cookiesPrice = 7;
// let candiesPrice = 8;

//* Can I buy both candies and cookies?
// let totalPrice = cookiesPrice + candiesPrice;

// if (amount < totalPrice) {
//   console.log("No, I need more money");
// } else {
//   console.log("Yes, I can buy everything");
// }
//* Yes, I can buy everything
//* No, I need more money

//! -----------------------  Task-2  ------------------------
//* У цьому завданні ти навчишся виводити дані в консоль.
//* Виведемо значення greeting, використовуючи метод console.log. Для цього напиши змінну в круглі дужки методу, наприклад:

// const variable = 123;
// console.log(variable);
// //* в консолі виведеться 123

//* Щоб переглянути значення, надруковані за допомогою console.log, у розділі Результати натисни Дивитися логи.

//! -----------------------  Task-2  ------------------------
//* А тепер знайди помилку в коді.

//* Код, який ми написали в редакторі, не працює 😢 Виправ оголошення змінної так, щоб він запрацював.

//! fix the mistake
//! const books = 5;
//! books = 7;

//? let books = 5;
//? books = 7;

//! -----------------------  Task-2  ------------------------
//* А тепер навчимося створювати змінні та зробимо фруктовий сік!

//* Ми маємо 4 кг яблук і 3 кг груш. Твоє завдання — оголосити 3 нові змінні:

//* apples зі значенням 4;
//* pears зі значенням 3;
//* fruits, значення якої дорівнює сумі змінних apples і pears.

// Наприклад:
// const apples = 4;

//! declare variables with correct values
// const apples = 4;
// const pears = 3;
// const fruits = apples + pears;

//! -----------------------  Task-2  ------------------------
//* А тепер потренуйся закоментовувати наш код.
//* Закоментуй const age і const name, використовуючи однорядкові коментарі (//).

// Наприклад:
// const name = 'Bob';
//! -----------------------  Task-2  ------------------------
//* У цьому завданні тобі потрібно розкоментувати код.
//* Для цього видали символи однорядкового коментаря `//`.
// const name = 'Alice';
// const age = 28;
//! -----------------------  Task-3  ------------------------
//* Змінні можуть зберігати різні дані. Це можуть бути числа, рядки, булеві значення тощо.

//* У цьому завданні ми створимо декілька змінних та запишемо у них дані різних типів.

//* Оголоси наступні змінні:

//* - brand зі значенням 'Toyota';
//* - price зі значенням 22500;
//* - isSedan зі значенням true;
//* - wings зі значенням undefined;
//* - owner зі значенням null.
//* Зверни увагу: для оголошення змінних використовуй ключове слово const. Наприклад, якщо потрібно оголосити змінну name зі значенням 'Ivan', це виглядатиме так:

// const name = 'Ivan';

//* Також переконайтеся, що ви явно присвоїли значення змінній під час оголошення за допомогою const. Наступний код викличе синтаксичну помилку:

// const surname; // SyntaxError: Missing initializer in const declaration

// const brand = "Toyota";
// const price = 22500;
// const isSedan = true;
// const wings = undefined;
// const owner = null;
//! -----------------------  Task-3  ------------------------

//! -----------------------  Task-3  ------------------------

//! -----------------------  Task-3  ------------------------
